#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform
module.iam_core.data.aws_region.current: Reading...
module.addons.data.aws_secretsmanager_secret_version.slack_webhook: Reading...
module.iam_core.data.aws_iam_policy_document.admin_assume: Reading...
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-093f8ae549551a5a3]
module.iam_irsa.aws_iam_policy.ebs_csi_driver_policy: Refreshing state... [id=arn:aws:iam::651706774390:policy/AWSEBSCSIDriverIAMPolicy]
module.addons.data.aws_secretsmanager_secret_version.grafana_admin: Reading...
module.eks.aws_eks_access_entry.console_user: Refreshing state... [id=effulgencetech-dev:arn:aws:iam::651706774390:user/musty]
module.s3.aws_s3_bucket.replication_bucket: Refreshing state... [id=dev-enterprise-replication-bucket]
module.eks.aws_launch_template.eks_nodes: Refreshing state... [id=lt-09182e5d29a37abf3]
module.eks.aws_eks_access_entry.nodes: Refreshing state... [id=effulgencetech-dev:arn:aws:iam::651706774390:role/dev-node-role]
module.iam_core.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ssm.data.aws_ssm_parameter.db_secret_parameter_name: Reading...
module.iam_core.data.aws_iam_policy_document.admin_assume: Read complete after 0s [id=3960366575]
module.iam_core.aws_iam_policy.prometheus_policy: Refreshing state... [id=arn:aws:iam::651706774390:policy/dev-prometheus-policy]
module.addons.data.aws_secretsmanager_secret_version.grafana_admin: Read complete after 1s [id=grafana-user-passwd|AWSCURRENT]
module.iam_core.data.aws_iam_policy_document.config_assume: Reading...
module.iam_core.data.aws_iam_policy_document.config_assume: Read complete after 0s [id=607352202]
module.iam_irsa.data.aws_caller_identity.current: Reading...
module.addons.data.aws_secretsmanager_secret_version.slack_webhook: Read complete after 1s [id=slack-webhook-alertmanager|AWSCURRENT]
module.iam_irsa.data.aws_secretsmanager_secret.grafana: Reading...
module.iam_irsa.data.aws_caller_identity.current: Read complete after 0s [id=651706774390]
module.iam_core.data.aws_caller_identity.current: Reading...
module.iam_core.data.aws_caller_identity.current: Read complete after 0s [id=651706774390]
module.iam_core.data.aws_iam_policy_document.prometheus_assume: Reading...
module.iam_core.data.aws_iam_policy_document.prometheus_assume: Read complete after 0s [id=2851119427]
module.ssm.data.aws_ssm_parameter.db_secret_parameter_name: Read complete after 1s [id=/db/secure/access]
module.vpc.aws_eip.eip[0]: Refreshing state... [id=eipalloc-04933b8bb76e66ada]
module.iam_core.aws_iam_policy.admin_policy: Refreshing state... [id=arn:aws:iam::651706774390:policy/admin-full-access]
module.iam_irsa.data.aws_secretsmanager_secret.grafana: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:651706774390:secret:grafana-user-passwd-h2uIZ4]
module.iam_core.data.aws_iam_policy_document.grafana_assume: Reading...
module.iam_core.data.aws_iam_policy_document.grafana_assume: Read complete after 0s [id=2851119427]
module.s3.aws_s3_bucket.operations_bucket: Refreshing state... [id=dev-enterprise-operations-bucket]
module.iam_core.aws_iam_role.cluster_role: Refreshing state... [id=dev-cluster-role]
module.iam_core.aws_iam_policy.cloudwatch_policy: Refreshing state... [id=arn:aws:iam::651706774390:policy/dev-cloudwatch-policy]
module.iam_core.aws_iam_role.node_group_role: Refreshing state... [id=dev-node-role]
module.ssm.data.aws_ssm_parameter.key_name_parameter_name: Reading...
module.ssm.data.aws_ssm_parameter.key_name_parameter_name: Read complete after 0s [id=/kp/name]
module.iam_core.data.aws_iam_policy_document.s3_rw_assume: Reading...
module.iam_core.data.aws_iam_policy_document.s3_rw_assume: Read complete after 0s [id=2851119427]
module.s3.data.aws_caller_identity.current: Reading...
module.iam_core.aws_iam_policy.grafana_policy: Refreshing state... [id=arn:aws:iam::651706774390:policy/dev-grafana-policy]
module.s3.data.aws_caller_identity.current: Read complete after 0s [id=651706774390]
module.s3.aws_s3_bucket.log_bucket: Refreshing state... [id=dev-enterprise-log-bucket]
module.iam_core.data.aws_iam_policy_document.s3_full_access_assume: Reading...
module.iam_core.data.aws_iam_policy_document.s3_full_access_assume: Read complete after 0s [id=2851119427]
module.iam_irsa.aws_iam_policy.alb_controller_policy: Refreshing state... [id=arn:aws:iam::651706774390:policy/AWSLoadBalancerControllerIAMPolicy]
module.app_ecr_repo["web"].aws_ecr_repository.dev_containers_repo: Refreshing state... [id=tankofm-web]
module.app_ecr_repo["app"].aws_ecr_repository.dev_containers_repo: Refreshing state... [id=tankofm-app]
module.app_ecr_repo["db"].aws_ecr_repository.dev_containers_repo: Refreshing state... [id=tankofm-db]
module.ssm.data.aws_ssm_parameter.db_access_parameter_name: Reading...
module.ssm.data.aws_ssm_parameter.key_path_parameter_name: Reading...
module.iam_core.aws_iam_role.prometheus_role: Refreshing state... [id=company-name-dev-prometheus-role]
module.iam_irsa.aws_iam_policy.grafana_secrets_access: Refreshing state... [id=arn:aws:iam::651706774390:policy/grafana-secretsmanager-access]
module.ssm.data.aws_ssm_parameter.db_access_parameter_name: Read complete after 0s [id=/db/access]
module.iam_core.aws_iam_role.grafana_role: Refreshing state... [id=company-name-dev-grafana-role]
module.ssm.data.aws_ssm_parameter.key_path_parameter_name: Read complete after 0s [id=/kp/path]
module.s3.aws_s3_bucket_policy.combined_logging_policy: Refreshing state... [id=dev-enterprise-log-bucket]
module.iam_core.aws_iam_role_policy_attachment.eks_cluster_policies["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=dev-cluster-role-2025121909484276770000000b]
module.s3.aws_s3_bucket_versioning.versioning_replication_bucket: Refreshing state... [id=dev-enterprise-replication-bucket]
module.iam_core.aws_iam_role_policy_attachment.eks_node_policies["arn:aws:iam::aws:policy/ElasticLoadBalancingFullAccess"]: Refreshing state... [id=dev-node-role-20251219094842698400000006]
module.iam_core.aws_iam_role_policy_attachment.eks_node_policies["arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy"]: Refreshing state... [id=dev-node-role-20251219094842740500000009]
module.iam_core.aws_iam_role_policy_attachment.eks_node_policies["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=dev-node-role-20251219094842632700000004]
module.iam_core.aws_iam_role_policy_attachment.eks_node_policies["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=dev-node-role-20251219094842669100000005]
module.iam_core.aws_iam_role_policy_attachment.eks_node_policies["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=dev-node-role-20251219094842610000000002]
module.iam_core.aws_iam_role_policy_attachment.eks_node_policies["arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"]: Refreshing state... [id=dev-node-role-20251219094842627600000003]
module.iam_core.aws_iam_role_policy_attachment.eks_node_policies["arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"]: Refreshing state... [id=dev-node-role-20251219094842719800000008]
module.iam_core.aws_iam_role_policy_attachment.prometheus_policy_attachment: Refreshing state... [id=company-name-dev-prometheus-role-2025121909484283130000000c]
module.iam_core.aws_iam_role_policy_attachment.cloudwatch_policy_attachment: Refreshing state... [id=company-name-dev-grafana-role-2025121909484276710000000a]
module.iam_core.aws_iam_role_policy_attachment.grafana_policy_attachment: Refreshing state... [id=company-name-dev-grafana-role-20251219094842717100000007]
module.s3.aws_s3_bucket_versioning.versioning_operations_bucket: Refreshing state... [id=dev-enterprise-operations-bucket]
module.iam_core.aws_iam_policy.config_policy: Refreshing state... [id=arn:aws:iam::651706774390:policy/aws-config-policy]
module.iam_core.aws_iam_policy.s3_rw_access: Refreshing state... [id=arn:aws:iam::651706774390:policy/S3AccessToBucket]
module.iam_core.aws_iam_policy.permission_boundary: Refreshing state... [id=arn:aws:iam::651706774390:policy/company-name-dev-permission-boundary]
module.vpc.aws_subnet.private_subnet["1"]: Refreshing state... [id=subnet-086732474407bafcf]
module.vpc.aws_subnet.private_subnet["0"]: Refreshing state... [id=subnet-03478f326d4f4c162]
module.vpc.aws_subnet.public_subnet["0"]: Refreshing state... [id=subnet-02a93336a04267b67]
module.vpc.aws_subnet.public_subnet["1"]: Refreshing state... [id=subnet-0303613902cc00ab4]
module.vpc.aws_internet_gateway.igw: Refreshing state... [id=igw-00524e02a53a881df]
module.bastion_sg.aws_security_group.bastion_sg: Refreshing state... [id=sg-0362e3e3535437399]
module.eks.aws_eks_cluster.dev_cluster: Refreshing state... [id=effulgencetech-dev]
module.iam_core.aws_iam_role.s3_full_access_role: Refreshing state... [id=company-name-dev-s3-full-access-role]
module.iam_core.aws_iam_role.vpc_flow_logs: Refreshing state... [id=company-name-dev-vpc-flow-logs-role]
module.iam_core.aws_iam_role.config_role: Refreshing state... [id=company-name-dev-config-role]
module.iam_core.aws_iam_role.admin_role: Refreshing state... [id=company-name-dev-admin-role]
module.iam_core.aws_iam_role.s3_rw_role: Refreshing state... [id=company-name-dev-s3-rw-role]
module.vpc.aws_nat_gateway.ngw[0]: Refreshing state... [id=nat-02cb70efaca81f9b2]
module.vpc.aws_route_table.PublicRT: Refreshing state... [id=rtb-0fda196e19db0913b]
module.s3.aws_s3_bucket_logging.operations_bucket_logging: Refreshing state... [id=dev-enterprise-operations-bucket]
module.s3.aws_s3_bucket_versioning.versioning_log_bucket: Refreshing state... [id=dev-enterprise-log-bucket]
module.vpc.aws_route_table.PrivateRT: Refreshing state... [id=rtb-067d6d05930ec8a17]
module.eks.aws_eks_access_policy_association.console_user_admin: Refreshing state... [id=effulgencetech-dev#arn:aws:iam::651706774390:user/musty#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_node_group.eks_worker_node["worker_nodes_config"]: Refreshing state... [id=effulgencetech-dev:worker_nodes_config]
module.iam_core.aws_iam_policy.s3_full_access_policy: Refreshing state... [id=arn:aws:iam::651706774390:policy/s3-full-access]
module.cluster_sg.aws_security_group.cluster_sg: Refreshing state... [id=sg-02571cbdebde3b146]
module.iam_core.aws_iam_role_policy_attachment.attach_admin_policy: Refreshing state... [id=company-name-dev-admin-role-2025121909484321060000000e]
module.vpc.aws_route_table_association.PublicSubnetAssoc["0"]: Refreshing state... [id=rtbassoc-09f89f0aa7a4bd1f2]
module.vpc.aws_route_table_association.PublicSubnetAssoc["1"]: Refreshing state... [id=rtbassoc-0c1384590de1ae604]
module.iam_core.aws_iam_role_policy_attachment.attach_s3_rw_policy: Refreshing state... [id=company-name-dev-s3-rw-role-2025121909484319320000000d]
module.iam_irsa.data.tls_certificate.oidc_cert: Reading...
module.vpc.aws_route_table_association.PrivateSubnetAssoc["0"]: Refreshing state... [id=rtbassoc-0c52d3c8d11f1da77]
module.vpc.aws_route_table_association.PrivateSubnetAssoc["1"]: Refreshing state... [id=rtbassoc-0513ca7283a12d502]
module.iam_core.aws_iam_role_policy.vpc_flow_logs_policy: Refreshing state... [id=company-name-dev-vpc-flow-logs-role:vpc-flow-logs-policy]
module.iam_core.aws_iam_role_policy_attachment.attach_s3_full_access_policy: Refreshing state... [id=company-name-dev-s3-full-access-role-2025121909484323280000000f]
module.node_sg.aws_security_group.node_sg: Refreshing state... [id=sg-047d7306f1d2fbfb7]
module.iam_irsa.data.tls_certificate.oidc_cert: Read complete after 0s [id=0c37bb608751c2a14704338d4b14c14e6dbe88ac]
module.iam_irsa.aws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::651706774390:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/993AA2CEEF47EC9F7C79E66950A57F0D]
module.iam_irsa.aws_iam_role.grafana_irsa: Refreshing state... [id=eks-grafana-irsa-role]
module.iam_irsa.aws_iam_role.ebs_csi_driver_role: Refreshing state... [id=eks-ebs-csi-driver-irsa]
module.iam_irsa.data.aws_iam_policy_document.vpc_cni_assume_role_policy: Reading...
module.iam_irsa.data.aws_iam_policy_document.alb_controller_oidc_trust: Reading...
module.iam_irsa.aws_iam_role.argocd_role: Refreshing state... [id=argocd-eks-management-role]
module.iam_irsa.data.aws_iam_policy_document.alb_controller_oidc_trust: Read complete after 0s [id=2143404469]
module.iam_irsa.data.aws_iam_policy_document.vpc_cni_assume_role_policy: Read complete after 0s [id=2197877794]
module.iam_irsa.aws_iam_role.alb_controller_role: Refreshing state... [id=aws-load-balancer-controller]
module.iam_irsa.aws_iam_role.vpc_cni_irsa_role: Refreshing state... [id=vpc-cni-irsa-role]
module.iam_irsa.aws_iam_role_policy_attachment.ebs_csi_driver_attach: Refreshing state... [id=eks-ebs-csi-driver-irsa-20251219095647030300000014]
module.iam_irsa.aws_iam_role_policy_attachment.argocd_policies["arn:aws:iam::aws:policy/AdministratorAccess"]: Refreshing state... [id=argocd-eks-management-role-2025121909564714840000001a]
module.iam_irsa.aws_iam_role_policy_attachment.argocd_policies["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=argocd-eks-management-role-20251219095647082200000016]
module.iam_irsa.aws_iam_role_policy_attachment.argocd_policies["arn:aws:iam::aws:policy/AmazonEKSComputePolicy"]: Refreshing state... [id=argocd-eks-management-role-20251219095647115900000019]
module.iam_irsa.aws_iam_role_policy_attachment.argocd_policies["arn:aws:iam::aws:policy/AmazonVPCFullAccess"]: Refreshing state... [id=argocd-eks-management-role-2025121909564719780000001b]
module.iam_irsa.aws_iam_role_policy_attachment.argocd_policies["arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy"]: Refreshing state... [id=argocd-eks-management-role-20251219095647051400000015]
module.iam_irsa.aws_iam_role_policy_attachment.argocd_policies["arn:aws:iam::aws:policy/ElasticLoadBalancingFullAccess"]: Refreshing state... [id=argocd-eks-management-role-20251219095647093300000017]
module.iam_irsa.aws_iam_role_policy_attachment.argocd_policies["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=argocd-eks-management-role-20251219095647108500000018]
module.iam_irsa.aws_iam_role_policy_attachment.grafana_secret_policy_attach: Refreshing state... [id=eks-grafana-irsa-role-2025121909564720160000001c]
module.iam_irsa.aws_iam_role_policy_attachment.alb_controller_attach: Refreshing state... [id=aws-load-balancer-controller-2025121909564721760000001d]
module.iam_irsa.aws_iam_role_policy_attachment.vpc_cni_policy_attach["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=vpc-cni-irsa-role-2025121909564727140000001e]
module.iam_irsa.aws_iam_role_policy_attachment.vpc_cni_policy_attach["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=vpc-cni-irsa-role-2025121909564727170000001f]
module.iam_irsa.aws_iam_role_policy_attachment.vpc_cni_policy_attach["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=vpc-cni-irsa-role-20251219095647310400000021]
module.addons.aws_eks_addon.addons["coredns"]: Refreshing state... [id=effulgencetech-dev:coredns]
module.addons.aws_eks_addon.addons["kube-proxy"]: Refreshing state... [id=effulgencetech-dev:kube-proxy]
module.addons.aws_eks_addon.addons["vpc-cni"]: Refreshing state... [id=effulgencetech-dev:vpc-cni]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.addons.helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                server:
                  service:
                    type: ClusterIP
                
                  extraArgs:
                    - --insecure
                
                  ingress:
                    enabled: false
            EOT,
        ]
      + verify                     = false
      + version                    = "9.1.9"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "server.serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "server.serviceAccount.name"
          + value = "argocd-server"
            # (1 unchanged attribute hidden)
        }
    }

  # module.addons.helm_release.aws_load_balancer_controller will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.16.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "effulgencetech-dev"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
    }

  # module.addons.helm_release.ebs_csi_driver will be created
  + resource "helm_release" "ebs_csi_driver" {
      + atomic                     = false
      + chart                      = "aws-ebs-csi-driver"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-ebs-csi-driver"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/aws-ebs-csi-driver"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "controller":
                  "serviceAccount":
                    "create": false
                    "name": "ebs-csi-controller-sa"
            EOT,
        ]
      + verify                     = false
      + version                    = "2.28.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.addons.helm_release.kube_prometheus_stack will be created
  + resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                grafana:
                  serviceAccount:
                    create: false
                    name: grafana     # Refers to the existing Service Account created via IRSA
                
                  service:
                    type: ClusterIP
                
                  ingress:
                    enabled: false
                
                  admin:
                    existingSecret: grafana-admin
                    userKey: admin-user
                    passwordKey: admin-password
                
                  persistence:
                    enabled: true
                    storageClassName: gp2
                    accessModes:
                      - ReadWriteOnce
                    size: 5Gi
                
                  resources:
                    limits:
                      cpu: 500m
                      memory: 512Mi
                    requests:
                      cpu: 250m
                      memory: 256Mi
                
                  grafana.ini:
                    auth.anonymous:
                      enabled: false
                    server:
                      root_url: "%(protocol)s://%(domain)s/"
                
                  serviceMonitor:
                    enabled: true
            EOT,
          + <<-EOT
                alertmanager:
                  alertmanagerSpec:
                    volumes:
                      - name: slack-webhook-secret
                        secret:
                          secretName: alertmanager-slack-webhook
                
                    volumeMounts:
                      - name: slack-webhook-secret
                        mountPath: /etc/alertmanager/secrets
                        readOnly: true
                
                  config:
                    global:
                      resolve_timeout: 5m
                
                    route:
                      receiver: slack-notifications
                
                    receivers:
                      - name: slack-notifications
                        slack_configs:
                          - api_url_file: /etc/alertmanager/secrets/slack_url
                            channel: "#alerts"
                            send_resolved: true
            EOT,
          + <<-EOT
                grafana:
                  sidecar:
                    dashboards:
                      enabled: true
                      label: grafana_dashboard
                      labelValue: "1"
                      folder: /var/lib/grafana/dashboards
                      defaultFolderName: "General"
                      searchNamespace: ALL
                
                  dashboardProviders:
                    dashboardproviders.yaml:
                      apiVersion: 1
                      providers:
                        - name: default
                          orgId: 1
                          folder: ""
                          type: file
                          disableDeletion: false
                          editable: true
                          options:
                            path: /var/lib/grafana/dashboards
            EOT,
          + <<-EOT
                prometheus:
                  prometheusSpec:
                    additionalPrometheusRules:
                      - name: custom-node-alerts
                        groups:
                          - name: node.rules
                            rules:
                              - alert: HighCPUUsage
                                expr: >
                                  100 - (avg by(instance)(rate(node_cpu_seconds_total{mode="idle",job="node-exporter"}[5m])) * 100) > 80
                                for: 2m
                                labels:
                                  severity: warning
                                annotations:
                                  summary: High CPU usage on {{ $labels.instance }}
                                  description: CPU usage has been above 80% for more than 2 minutes.
                
                              - alert: HighMemoryUsage
                                expr: >
                                  (node_memory_MemTotal_bytes - node_memory_MemAvailable_bytes) / node_memory_MemTotal_bytes * 100 > 80
                                for: 2m
                                labels:
                                  severity: warning
                                annotations:
                                  summary: High memory usage on {{ $labels.instance }}
                                  description: Memory usage has exceeded 80% for more than 2 minutes.
                
                              - alert: NodeDown
                                expr: up{job="node-exporter"} == 0
                                for: 1m
                                labels:
                                  severity: critical
                                annotations:
                                  summary: Node {{ $labels.instance }} is down
                                  description: Prometheus target {{ $labels.instance }} is unreachable (up == 0)
                
                      - name: test-alert
                        groups:
                          - name: test.rules
                            rules:
                              - alert: TestAlert
                                expr: vector(1)
                                for: 1m
                                labels:
                                  severity: info
                                annotations:
                                  summary: This is a test alert
                                  description: Firing to test Alertmanager and Slack integration
            EOT,
        ]
      + verify                     = false
      + version                    = "56.7.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.addons.kubernetes_config_map_v1.grafana_dashboards will be created
  + resource "kubernetes_config_map_v1" "grafana_dashboards" {
      + data = {
          + "combined-dashboards.json"  = jsonencode(
                {
                  + annotations   = {
                      + list = []
                    }
                  + panels        = [
                      + {
                          + datasource = "Prometheus"
                          + gridPos    = {
                              + h = 8
                              + w = 12
                              + x = 0
                              + y = 0
                            }
                          + targets    = [
                              + {
                                  + expr         = "sum(rate(node_cpu_seconds_total{mode!=\"idle\"}[5m])) by (instance)"
                                  + legendFormat = "CPU"
                                  + refId        = "A"
                                },
                            ]
                          + title      = "CPU Usage"
                          + type       = "graph"
                        },
                      + {
                          + datasource = "Prometheus"
                          + gridPos    = {
                              + h = 8
                              + w = 12
                              + x = 12
                              + y = 0
                            }
                          + targets    = [
                              + {
                                  + expr         = "node_memory_MemAvailable_bytes / node_memory_MemTotal_bytes"
                                  + legendFormat = "Memory"
                                  + refId        = "B"
                                },
                            ]
                          + title      = "Memory Usage"
                          + type       = "graph"
                        },
                      + {
                          + datasource = "Prometheus"
                          + gridPos    = {
                              + h = 8
                              + w = 24
                              + x = 0
                              + y = 8
                            }
                          + targets    = [
                              + {
                                  + expr         = "kube_pod_status_phase{phase=\"Running\"}"
                                  + legendFormat = "Pods Running"
                                  + refId        = "C"
                                },
                            ]
                          + title      = "Pods Running"
                          + type       = "graph"
                        },
                    ]
                  + schemaVersion = 36
                  + title         = "Cluster Overview"
                  + version       = 1
                }
            )
          + "cpu-dashboard.json"        = jsonencode(
                {
                  + annotations   = {
                      + list = []
                    }
                  + panels        = [
                      + {
                          + datasource = "Prometheus"
                          + targets    = [
                              + {
                                  + expr         = "sum(rate(node_cpu_seconds_total{mode!=\"idle\"}[5m])) by (instance)"
                                  + legendFormat = "CPU"
                                  + refId        = "A"
                                },
                            ]
                          + title      = "CPU Usage"
                          + type       = "graph"
                        },
                    ]
                  + schemaVersion = 36
                  + title         = "CPU Dashboard"
                  + version       = 1
                }
            )
          + "memory-dashboard.json"     = jsonencode(
                {
                  + annotations   = {
                      + list = []
                    }
                  + panels        = [
                      + {
                          + datasource = "Prometheus"
                          + targets    = [
                              + {
                                  + expr         = "node_memory_MemAvailable_bytes / node_memory_MemTotal_bytes"
                                  + legendFormat = "Memory"
                                  + refId        = "A"
                                },
                            ]
                          + title      = "Memory Usage"
                          + type       = "graph"
                        },
                    ]
                  + schemaVersion = 36
                  + title         = "Memory Dashboard"
                  + version       = 1
                }
            )
          + "pod-status-dashboard.json" = jsonencode(
                {
                  + annotations   = {
                      + list = []
                    }
                  + panels        = [
                      + {
                          + datasource = "Prometheus"
                          + targets    = [
                              + {
                                  + expr         = "kube_pod_status_phase{phase=\"Running\"}"
                                  + legendFormat = "Pod Status"
                                  + refId        = "A"
                                },
                            ]
                          + title      = "Pods Running"
                          + type       = "graph"
                        },
                    ]
                  + schemaVersion = 36
                  + title         = "Pod Status Dashboard"
                  + version       = 1
                }
            )
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "grafana_dashboard" = "1"
            }
          + name             = "grafana-dashboards"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.addons.kubernetes_namespace_v1.argocd will be created
  + resource "kubernetes_namespace_v1" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.addons.kubernetes_namespace_v1.monitoring will be created
  + resource "kubernetes_namespace_v1" "monitoring" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.addons.kubernetes_secret_v1.alertmanager_slack_webhook will be created
  + resource "kubernetes_secret_v1" "alertmanager_slack_webhook" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "alertmanager-slack-webhook"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.addons.kubernetes_secret_v1.grafana_admin will be created
  + resource "kubernetes_secret_v1" "grafana_admin" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "grafana-admin"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.addons.kubernetes_service_account_v1.alb_controller_sa will be created
  + resource "kubernetes_service_account_v1" "alb_controller_sa" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn" = "arn:aws:iam::651706774390:role/aws-load-balancer-controller"
            }
          + generation       = (known after apply)
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.addons.kubernetes_service_account_v1.argocd_sa will be created
  + resource "kubernetes_service_account_v1" "argocd_sa" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn" = "arn:aws:iam::651706774390:role/argocd-eks-management-role"
            }
          + generation       = (known after apply)
          + name             = "argocd-server"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.addons.kubernetes_service_account_v1.ebs_csi_controller will be created
  + resource "kubernetes_service_account_v1" "ebs_csi_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn" = "arn:aws:iam::651706774390:role/eks-ebs-csi-driver-irsa"
            }
          + generation       = (known after apply)
          + name             = "ebs-csi-controller-sa"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.addons.kubernetes_service_account_v1.grafana will be created
  + resource "kubernetes_service_account_v1" "grafana" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn" = "arn:aws:iam::651706774390:role/eks-grafana-irsa-role"
            }
          + generation       = (known after apply)
          + name             = "grafana"
          + namespace        = "monitoring"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.aws_eks_access_entry.nodes will be destroyed
  # (because aws_eks_access_entry.nodes is not in configuration)
  - resource "aws_eks_access_entry" "nodes" {
      - access_entry_arn  = "arn:aws:eks:us-east-1:651706774390:access-entry/effulgencetech-dev/role/651706774390/dev-node-role/1acd9b58-5ed9-d77a-b13d-1d82ed93e8e4" -> null
      - cluster_name      = "effulgencetech-dev" -> null
      - created_at        = "2025-12-19T12:58:31Z" -> null
      - id                = "effulgencetech-dev:arn:aws:iam::651706774390:role/dev-node-role" -> null
      - kubernetes_groups = [
          - "system:nodes",
        ] -> null
      - modified_at       = "2025-12-19T12:58:31Z" -> null
      - principal_arn     = "arn:aws:iam::651706774390:role/dev-node-role" -> null
      - tags_all          = {} -> null
      - type              = "EC2_LINUX" -> null
      - user_name         = "system:node:{{EC2PrivateDNSName}}" -> null
    }

  # module.eks.aws_eks_node_group.eks_worker_node["worker_nodes_config"] will be updated in-place
  ~ resource "aws_eks_node_group" "eks_worker_node" {
        id                     = "effulgencetech-dev:worker_nodes_config"
        tags                   = {}
        # (16 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-09182e5d29a37abf3"
            name    = "eks-node-lt"
          ~ version = "1" -> "$Latest"
        }

        # (2 unchanged blocks hidden)
    }

  # module.node_sg.aws_security_group.node_sg will be updated in-place
  ~ resource "aws_security_group" "node_sg" {
        id                     = "sg-047d7306f1d2fbfb7"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow all node-to-node traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow control plane to reach nodes"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow kubelet API from control plane"
              + from_port        = 10250
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 10250
            },
        ]
        name                   = "Dev-public-sg"
        tags                   = {
            "Environment" = "Dev"
            "Name"        = "Dev-node-sg"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 13 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dainmusty, Action: `pull_request`*